
public class Update {

    // 2016/01/09前修改
    String Update1 = ""
            + "[新增] 指令 !Reloadall"
            + "[新增] 指令 !清除道具"
            + "[新增] 精靈商人、私聊 監聽開關"
            + "[新增] 防外掛：打怪物數量、攻擊次數"
            + "[新增] VIP系統"
            + "[新增] 精靈商人購買Log"
            + "[新增] 玩家私聊Log"
            + "[新增] 帳號註冊Log"
            + "[新增] 自動存檔、自動解卡角色"
            + "[整理] GM權限列表"
            + "[整理] 刪除重複指令"
            + "[修改] 使所有指令能跨頻道使用"
            + "[修改] !gainCash 發給人"
            + "[修改] 使所有指令能跨頻道使用"
            + "[修改] 登入時封包管理帳號傳送值跟一班玩家一樣(使精靈商人管理能使用)"
            + "";

    //2016/01/11重開伺服器後
    String Update2 = ""
            + "[新增] 玩家好友、隊伍、公會、聯盟Log"
            + "[新增] 加載地圖時載入自訂義NPC(Wz_customlife)"
            + "[新增] 反吸怪系統測試"
            + "[新增] 原始反掛系統GM密語"
            + "[新增] VIP控制勳章顯示開關"
            + "[新增] 基礎VIP指令"
            + "[修改] VIP勳章顯示時始用<>包括"
            + "[修改] VIP新增的點數商品日期不包括掉寶、經驗雙倍卡"
            + "[修復] 反外掛系統『打怪數量檢測』異常";
    //2016/01/11 重開伺服器後
    String Update3 = ""
            + "[新增] 密語log"
            + "[修復] 購物商城放入道具斷線 - 花花提供"
            + "[修復] 寵物VIP買了後異常";
    //2016/01/15 重開伺服器後
    String Update4 = ""
            + "[新增] 防外掛系統"
            + "[修改] 指令!warp 重購"
            + "[修復] 主教     - 傳送門連放斷線"
            + "[修復] 暗影神偷  -  勇者掠奪術斷線"
            + "[修復] 冰雷     - 閃電雷鳴斷線"
            + "[修復] 報錯輸出文件";
    //2016/01/17 重開伺服器後
    String update5 = ""
            + "[新增] 兩種GM權限"
            + "[新增] 防禦   快速恢復HPMP外掛"
            + "[新增] 防禦   招喚獸無延遲"
            + "[新增] 完成   防吸怪系統"
            + "[修復] 火毒 - 毒霧傷害異常"
            + "[修復] 狂郎 - 矛之鬥氣、連環吸血、強化連擊、精準擊退";
    //2016/01/18 重開伺服器後
    String update6 = ""
            + "[新增] !help !viphelp"
            + "[修改] 火毒 - 毒霧傷害隨技能等級遞增"
            + "[修復] 狂郎 - Combo不會扣";
    //2016/01/19 重開伺服器後
    String update7 = ""
            + "[修改] 移除Acash緩存 讀取/寫入 採取直接資料庫修改"
            + "[修改] 吸怪系統判斷拉高"
            + "[修改] 狂狼攻擊速度誤判為外掛"
            + "[修改] 聖光被誤判為外掛"
            + "[修復] 火毒 - 完全正常毒霧傷害"
            + "[修復] 狂郎 - 使用吸血術時累計Combo不會扣";
    //2016/01/24 重開伺服器後
    String update8 = ""
            + "[新增] 黑單指令"
            + "[新增] 指令 @jk - 重製角色"
            + "[新增] 指令 @jk_mh - 刪除卡在精靈商人的物品"
            + "[修改] !Item 可直接叫出寵物"
            + "[修改] 每小時自動給點數改為楓葉點數"
            + "[修改] 部分防外掛系統直接鎖"
            + "[修改] 拳霸攻擊速度誤判為外掛"
            + "[修復] 部分怪獸卡的加錢加掉落率只能在限定地圖"
            + "[修復] deregisterPlayer的程式碼錯誤"
            + "[修復] CancelChair的程式碼錯誤"
            + "[修復] WARP指令的程式碼錯誤"
            + "[修復] 自動給VIP沒儲存到資料庫"
            + "[修復] 闇靈治癒斷線"
            + "[修復] 背包滿時購買精靈商人道具時提示背包滿了還是扣錢"
            + "[修復] 擴充背包扣的錢錯誤、可使用楓葉點數擴充"
            + "[修復] 擴充倉庫斷線";
    String update9 = ""
            + "[新增] 修改　裝備封包、使用椅子封包、現金道具特效封包、丟楓幣包、表情封包　自動封鎖"
            + "[修改] 毒霧傷害"
            + "[新增] 技能偵測"
            + "[修改] 嘗試修改儲存LAG"
            + "[修復] 寵物撿物的時候可以攻擊"
            + "[修復] 交易時換地圖道具消失"
            + "[修復] 個人商店BUG"
            + "[修復] HPMP無法自動回復"
            + "[修復] 個人商店無法踢人"
            + "[修復] 章魚燒效果異常"
            + "[修復] 疲勞值異常"
            + "[修復] 烈火箭易斷線"
            + "[修復] 精靈商人正常情況不吃道具";

    String update10 = ""
            + "[新增] 全圖打偵測系統測試上線"
            + "[新增] addSkill技能檢測"
            + "[新增] 交易對話紀錄"
            + "[新增] 新增指令 !BanStatus <玩家名稱> - 查看玩家是否被封鎖及原因"
            + "[修復] 變身能力不加"
            + "[修復] 程式碼部分錯誤"
            + "[修復] 寵物技能"
            + "[修復] 火炎膠囊、寒冰膠囊沒有扣"
            + "[修復] 楓葉市集燈泡異常"
            + "[修復] 新版寵物無法召喚"
            + "[修復] 指令 - !banID 相關問題"
            + "[修復] 新手技能轉職後無法學習";

    String update11 = ""
            + "[修正] 飛毒殺傷害計算"
            + "[修正] 封包延遲"// 放空
            + "[修復] 替身術坐標錯誤"// 放空
            + "[修復] 召喚獸朝向錯誤"// 放空
            + "[修復] 飛毒殺沒效果" // Kodan
            + "[修復] 替身術面對方向";// Kodan

    String update12 = ""
            + "[增加] 地圖腳本提示"
            + "[增加] NPC函數WarpParty(mapid, PortalName)"
            + "[增加] NPC腳本檢測NPC是否存在"
            + "[增加] NPC不存在時顯示訊息"
            + "[修復] 寵物食品封包HACK";

    String update13 = ""
            + "[新增] 封鎖時封鎖MAC(離線、封鎖)"
            + "[新增] 指令 !BanMAC !BanIP"
            + "[新增] 記憶體自動釋放(每小時)"
            + "[修改] 錯誤輸出為err"
            + "[修改] 註冊帳號以MAC判斷重複註冊"
            + "[修改] 封鎖時連MAC一起封鎖"
            + "[修改] 指令!BanStatus"
            + "[修復] 風箏無法召喚(Kodan)"
            + "[修復] 卡珊德拉的獎勵倍率異常"
            + "[修復] 掉寶倍率顯示異常"
            + "[修復] 倉庫楓幣不儲存"
            + "[修復] 登入時讀取MAC";
    String update14 = ""
            + "[修改] 開服密碼由GUI輸入"
            + "[修改] 隱分身技能攻擊次數判斷"
            + "[修改] 椅子封包判斷";
    //20160318
    String update15 = ""
            + "[新增] 封鎖地圖增加"
            + "[新增] 指令高級檢索"// 放空
            + "[修改] 全圖打改成不鎖"
            + "[修復] 海盜船 點數騎寵38"// Kodan
            + "[修復] 寵物名稱異常導致38"// Kodan
            + "[修復] 交易BUG"// Kodan
            + "[修復] 裝備成長效果38"// 放空
            + "[修復] 道具等級顯示異常(即時更新未完成)"// 放空
            + "[修復] NPC不會走動的BUG"// 放空
            + "[修復] NPC_ACTION 38";// 放空
    //20160318-2
    String update16 = ""
            + "[增加] ZZMS(放空)的移除不存在寵物含數"
            + "[修改] queststatusid(任務流水號) inventoryitemid(裝備流水號) 改為Long"
            + "[新增] A/B 增加Log紀錄"
            + "[修復] moveMonster 某些怪物讓遊戲死當";// 花花
    //20160320
    String update17 = ""
            + "[修改] 輸出文字檔案大小一個約1000KB換下一個檔案"
            + "[修改] 預計傷害Log內容"
            + "[修復] 寵物導致點個人訊息38";
    //20160324
    String update18 = ""
            + "[修改] 輸出含數增加參數可控制是否根據檔案大小創立新文字檔輸出"
            + "[修改] Mina 架構改成 Netty "// 放空
            + "[修改] 矛傷害計算公式"
            + "[修復] 在魔法森林搭船去耶雷弗 直接下線會到天空之城"// Kodan
            + "[修復] 寵物技能導致的問題"// Kodan
            + "[修復] 精靈商人意外的錯誤"// Kodan
            + "[修復] 函數獲取道具名稱為Null"// 放空
            + "[修復] 腳本獲取寵物道具不會創建寵物的問題"// 放空
            + "[修復] 群寵從中間或者前面取消裝備寵物造成例外的問題";// 放空

    String update19 = ""
            + "[增加] 指令 !debug "
            + "[修改] 指令!banstatus　!spy"
            + "[修改] GainNX函數隨機數使延遲降低"
            + "[修改] 部分連接資料庫連線選取範圍(減少消耗不必要資源)"
            + "[移除] 攻擊速度檢測"
            + "[移除] 廣播輸出";

    String update30 = ""
            + "[增加] 刪除角色Log角色名"
            + "[增加] 指令 !maxstats !minstats"
            + "[增加] 換頻自動更新VIP"
            + "[修復] BQ內BOSS永久暈"
            + "[修改] setVip直接update資料庫"
            + "[修改] 移除Vip存檔(支援線上修改，需重登)"
            + "[修改] 指令!warpt"
            + "[修改] 指令!warp"
            + "[修改] 指令加入公會不提示";

    String update31 = ""
            + "[增加] 更新BOSS地圖"
            + "[增加] 更新例外技能"
            + "[修復] 移動封包處理錯誤"//Kodan
            + "[修復] 公會戰可以洗東西bug"//Kodan
            + "[修復] 宙斯之盾效果"//Kodan
            + "[修復] 狂狼勇士4轉 - 防禦戰術 沒效果"
            + "[修復] 聖騎士 - 武神防禦效果";

    String update32 = ""
            + "[新增] BOSS地圖(龍王關卡)"
            + "[修復] 公會踢人空值造成38及無法踢人"
            + "[修復] 指令@jcds"
            + "[修復] !spy 倉庫導致空值"
            + "[修復] sendDestroyData空值"
            + "[修復] spawnMonster"// 不確定
            + "[移除] @jk";

    String update33 = ""
            + "[修復] 龍王地圖未增加完全" //Kodan
            + "[修復] 拉圖斯地圖BUG" // Kodan
            + "[修復] 更新帳號解卡問題"// Kodan
            + "[修復] 個人商店購買東西斷線"// Kodan
            + "[修復] 個人商店手續費"// Kodan
            + "[修改] 倉庫動作後立即存檔"
            + "[移除] 海盜船斷線";

    String update34 = ""
            + "[新增] 10等之前傷害異常判斷"
            + "[新增] 更完全解除卡角"
            + "[新增] 晚上12點不舉辦活動"
            + "[修正] GUI內角色狀態未處理"
            + "[修復] 寵物撿自己丟出的道具"
            + "[修復] 野外BOSS血條"
            + "[修復] addMonsterStatus造成的38"
            + "[修復] Family、BBS、applyTo、!shop、!speak、指令處理報錯";

    String update35 = ""
            + "[修復] 登入帳號解卡問題" // 放空
            + "[修復] 嘗試修正經驗異常問題;"// 放空
            + "[修復] 占卜相關";

    String update36 = ""
            + "[增加] 寵物全圖吸檢測";

}
